In [1]:
import pandas as pd
import sqlalchemy as db

connection_str = f'mysql+pymysql://root:admin@172.17.0.2:3306/imdb'
engine = db.create_engine(connection_str)
conn = engine.connect()

In [10]:
query = '''
    SELECT tconst, COUNT(*) AS cont
    FROM title_principals
    GROUP BY tconst
'''
df = pd.read_sql(query, conn)

In [11]:
df.sort_values('cont', ascending=False).head()

         tconst  cont
0     tt0160904    10
2703  tt3865722    10
2690  tt3793630    10
2691  tt3807022    10
2692  tt3815412    10